main.org
#+latex_class: acmart
#+latex_class_options: [acmtog]
#+latex_header: \usepackage{siggraph}
#+latex_header_extra:
#+description:
#+keywords:
#+subtitle:
#+title: A Multifrequency MAC Specially Designed for Wireless Sensor Network Applications
#+author: 
#+options: toc:nil
#+latex_compiler: pdflatex
#+date: \today

#+begin_abstract
Multifrequency media access control...
#+end_abstract
* introduction
* mmsn protocol
** Frequency Assignment
A natural candidate is an increasing geometric sequence, in which
#+begin_export latex
\begin{equation}
P(t)=\frac{b^{\frac{t+1}{T+1}}-b^{\frac{t}{T+1}}}{b-1}
\end{equation}
#+end_export
where $t = 0,...,T$, and $b$ is a number greater than 1.\\
#+begin_export latex
\begin{algorithm}[t]
\SetAlgoNoLine
\KwIn{Node $\alpha$'s ID ($ID_{\alpha}$), and node $\alpha$'s
neighbors' IDs within two communication hops.}
\KwOut{The frequency number ($FreNum_{\alpha}$) node $\alpha$ gets assigned.}
$index$ = 0; $FreNum_{\alpha}$ = -1\;
\Repeat{$FreNum_{\alpha} > -1$}{
        $Rnd_{\alpha}$ = Random($ID_{\alpha}$, $index$)\;
        $Found$ = $TRUE$\;
        \For{each node $\beta$ in $\alpha$'s two communication hops
    }{
      $Rnd_{\beta}$ = Random($ID_{\beta}$, $index$)\;
      \If{($Rnd_{\alpha} < Rnd_{\beta}$) \text{or} ($Rnd_{\alpha}$ ==
          $Rnd_{\beta}$ \text{and} $ID_{\alpha} < ID_{\beta}$)\;
      }{
        $Found$ = $FALSE$; break\;
      }
        }
     \eIf{$Found$}{
           $FreNum_{\alpha}$ = $index$\;
         }{
           $index$ ++\;
     }
      }
\caption{Frequency Number Computation}
\label{alg:one}
\end{algorithm}
#+end_export
*** Exclusive Frequency Assignment. 
In exclusive frequency...
* simulator
If the model checker requests ...

| Name  | Phone | Age |
|-------+-------+-----|
| Peter |  1234 |  17 |
| Anna  |  4321 |  25 |
* TODO siggraph [1/2]
** TODO [#B] hello 
   SCHEDULED: <2020-05-13 三>
** DONE [#A] 2020
   DEADLINE: <2020-05-16 六>
